Pandas Series

A Pandas Series is like a column in a table . it is a 1-D array holding data of any type

In [5]:
import numpy as np 
import pandas as pd

In [6]:
Days=['sunday','monday','tuesday ','wednesday','thuesday','friday','satuarday']

In [7]:
pd.Series(Days)

0       sunday
1       monday
2     tuesday
3    wednesday
4     thuesday
5       friday
6    satuarday
dtype: object

In [8]:
marks = [10,20,30]
subs = ['math','scie','hindi']

In [9]:
pd.Series(marks,index=subs)

math     10
scie     20
hindi    30
dtype: int64

In [10]:
type(pd.Series(marks,index=subs))

pandas.core.series.Series

In [11]:
pd.Series(marks,index=subs,name ='dusyant numbers')

math     10
scie     20
hindi    30
Name: dusyant numbers, dtype: int64

In [12]:
dict = {
"arjun":10,
"dusyant":20,
"varun":30


}

In [17]:
a = pd.Series(dict,name='my dict')

In [18]:
#series attributes
a.size

3

In [19]:
a.name

'my dict'

In [20]:
pd.Series([1,1,2,2,3])

0    1
1    1
2    2
3    2
4    3
dtype: int64

In [21]:
b = pd.Series([1,1,2,2,3])

In [22]:
b.is_unique

False

In [23]:
a

arjun      10
dusyant    20
varun      30
Name: my dict, dtype: int64

In [24]:
a.is_unique

True

In [25]:
a.index

Index(['arjun', 'dusyant', 'varun'], dtype='object')

In [26]:
b.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
a.values

array([10, 20, 30], dtype=int64)

In [29]:
data = pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\vs code\\pandas\\kohli_ipl.csv")

In [30]:
data

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [ ]:
pd.read_csv()
pd.read_excel()
pd.read_json()
pd.read_html()
pd.read_table()

In [31]:
data

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [32]:
data.head()

   match_no  runs
0         1     1
1         2    23
2         3    13
3         4    12
4         5     1

In [33]:
data.tail()

     match_no  runs
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

In [38]:
sample = data.sample(10)

In [39]:
sample

     match_no  runs
179       180    14
2           3    13
171       172     7
84         85    56
123       124    20
142       143    21
101       102    18
103       104    62
81         82    99
163       164   100

In [40]:
data.head(3)

   match_no  runs
0         1     1
1         2    23
2         3    13

In [45]:
data = pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\vs code\\pandas\\kohli_ipl.csv",index_col="match_no")
type(data)

pandas.core.frame.DataFrame

In [46]:
data

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [47]:
data.head(5)

          runs
match_no
1            1
2           23
3           13
4           12
5            1

In [48]:
data.value_counts

<bound method DataFrame.value_counts of           runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]>

In [49]:
data

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [53]:
bollywod=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\vs code\\pandas\\bollywood.csv")

In [54]:
bollywod

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [55]:
bollywod.head(7)

                                  movie                  lead
0              Uri: The Surgical Strike         Vicky Kaushal
1                         Battalion 609           Vicky Ahuja
2  The Accidental Prime Minister (film)           Anupam Kher
3                       Why Cheat India         Emraan Hashmi
4                       Evening Shadows      Mona Ambegaonkar
5                           Soni (film)  Geetika Vidya Ohlyan
6                         Fraud Saiyaan          Arshad Warsi

In [58]:
subs=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\vs code\\pandas\\subs.csv")

In [59]:
subs.head(10)

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44
5                  46
6                  33
7                  40
8                  44
9                  74

In [60]:
subs.tail(5)

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [61]:
subs.sample(7)

     Subscribers gained
73                   80
144                  86
159                 118
131                  79
303                 157
138                  74
106                  77

In [63]:
bollywod

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [65]:
bollywod.value_counts()

movie                     lead
Andaaz                    Akshay Kumar        2
Tanu Weds Manu: Returns   Kangana Ranaut      2
Gabbar Is Back            Akshay Kumar        2
1920 (film)               Rajniesh Duggall    1
Newton (film)             Rajkummar Rao       1
                                             ..
Ghayal: Once Again        Sunny Deol          1
Ghanchakkar (film)        Vidya Balan         1
Ghajini (2008 film)       Aamir Khan          1
Genius (2018 Hindi film)  Utkarsh Sharma      1
Zor Lagaa Ke...Haiya!     Meghan Jadhav       1
Name: count, Length: 1497, dtype: int64

In [70]:
bollywod.sort_index(ascending=True)

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]